Revit 2026 API

# AreaVolumeSettingsComputeVolumes Property

---

True to enable volume computation. False to disable it.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ComputeVolumes { get; set; }
```
```vb
Public Property ComputeVolumes As Boolean
	Get
	Set
```
```cpp
public:
property bool ComputeVolumes {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ComputeVolumes : bool with get, set
```

#### Property Value

Boolean

When this setting is False, rooms and spaces will be treated as simple extrusions of their 2d boundaries. The volume parameter will report "not computed". When this setting is True, the geometry of rooms and spaces will be trimmed when it intersects elements such as ceilings, roofs, and floors.

#### Reference

AreaVolumeSettings Class

Autodesk.Revit.DB Namespace